var countDownDate = new Date("Dec 7, 2025 11:00:00").getTime();

var text11 = "Στη μνήμη των 57 των Τεμπών";
var text12 = "Στις 28 Φεβρουαρίου 2023 ένα ζοφερό δυστύχημα πραγματοποιήθηκε με τη μετωπική σύγκρουση μίας εμπορικής και μίας επιβατικής αμαξοστοιχίας στο δρομολόγιο Αθήνας- Θεσσαλονίκης. Τα δύο τρένα, που συγκρούστηκαν με ταχύτητες άνω των 140 χιλιομέτρων την ώρα, προκάλεσαν τον θάνατο 57 ανθρώπων και τον τραυματισμό πάνω από 85. Ήταν το χειρότερο σιδηροδρομικό δυστύχημα στην ιστορία της χώρας μας και ένα από τα πιο φονικά στην Ευρώπη τα τελευταία χρόνια.";
var text13 = "Οι ελλείψεις σε τεχνικό εξοπλισμό, ανθρώπινο δυναμικό και σύστημα τηλεδιοίκησης στον σιδηρόδρομο αύξησαν, επίσης, την πιθανότητα να συμβεί ένα ατύχημα από λάθος, γι' αυτό και ο Υπουργός Μεταφορών οδηγήθηκε τότε στην παραίτηση. Δύο χρόνια μετά οι συγγενείς των θυμάτων ψάχνουν ακόμη απαντήσεις και δικαίωση για το τραγικό αυτό γεγονός.";

var text21 = "Ρεπορτάζ: Ενδοοικογενειακή βία, οι αδύναμοι κρίκοι"
var text22 = "Η ενδοοικογενειακή βία είναι ένα θέμα που πλέον θίγεται όλο και περισσότερο στις ειδήσεις και στις εφημερίδες. Οι γυναικοκτονίες είναι το τελευταίο διάστημα η πιο πολυσυζητημένη μορφή αυτής της βίας. Είναι ένα φρικτό αδίκημα που από πάντα αναδείκνυε τα προβλήματα στη δομή της κοινωνίας, αλλά τώρα προβληματίζει εντονότερα με τον ρυθμό που αυξάνεται. Στο διάγραμμα από τα στοιχεία της Ελληνικής Αστυνομίας φαίνεται ότι από το 2012 μέχρι το 2022 το ποσοστό των καταμετρημένων δολοφονιών ως γυναικοκτονίες ανέβηκε κατά 82%, ενώ από 11 καταγεγραμμένες γυναικοκτονίες το 2010 φτάνουμε στις 24 το 2022."
var text23 = "Οι θύτες, που είναι συνήθως οι σύντροφοι, έχουν χαμηλή αυτοεκτίμηση και μετρούν την αξία τους με τη βίαιη συμπεριφορά τους. Συχνά δεν αντιλαμβάνονται τις συνέπειες των πράξεών τους στο θύμα. Χρησιμοποιούν αυταρχισμό και ψυχολογικούς εκβιασμούς και όταν οι επιθυμίες τους δεν γίνονται πραγματικότητα εμφανίζεται η βία. Στη σύγχρονη εποχή η βία μπορεί να κρύβεται ακόμη και στη γειτονική πόρτα."

var title = document.getElementById("randTitle");
var para1 = document.getElementById("rand1");
var para2 = document.getElementById("rand2");

var randNumber = Math.floor(Math.random() * 2) + 1;

if (randNumber === 1) {
    title.innerHTML = text11;
    para1.innerHTML = text12;
    para2.innerHTML = text13;
} else if (randNumber === 2) {
    title.innerHTML = text21;
    para1.innerHTML = text22;
    para2.innerHTML = text23;
}

var x = setInterval(function () {

    var now = new Date().getTime();

    var distance = countDownDate - now;

    var days = Math.floor(distance / (1000 * 60 * 60 * 24));
    var hours = Math.floor((distance % (1000 * 60 * 60 * 24)) / (1000 * 60 * 60));
    var minutes = Math.floor((distance % (1000 * 60 * 60)) / (1000 * 60));
    var seconds = Math.floor((distance % (1000 * 60)) / 1000);

    document.getElementById("timer").innerHTML = days + " Μέρες " + hours + " Ώρες " + minutes + " Λεπτά " + seconds + " Δευτερόλεπτα ";

    if (distance < 0) {
        clearInterval(x);
        document.getElementById("timer").innerHTML = "Έληξε η αντίστροφη μέτρηση!";
    }
}, 1000);